print("Програма для роботи з реченням.")
print()

# отримую дані на вхід
while True:
    sent = input("Введіть речення з двох чи більше слів: ").strip()
    if sent.find(" ") == -1:
        print("Помилка. Ви ввели одне слово або не ввели пробіл між словами.")
        continue
    else:
        break

# видаляю знаки пунктуації та різні символи, крім '(апостроф) та - (дефіс)
marks = '''.,:;!?/|\\()[]{}"$#%^><=~_№&*+@1234567890'''
for a in marks:
    sent = sent.replace(a, " ")

# розділяю отриману строку за " " та отримую список
# якщо не ввести параметр " ", то усі пробіли видаляться автоматично
sent = sent.split(" ")

# видаляю пусті рядки, дефіс- та апостроф-рядки зі списку
while "" in sent:
    sent.remove("")
while "-" in sent:
    sent.remove("-")
while "'" in sent:
    sent.remove("'")

# виконую сортування списку
sent.sort()

# виводжу шапку для таблиці значень
b = len(str(len(sent))) + 11
c = 0
for j in sent:
    if len(j) > c:
        c = len(j)
print("{0:^{2}} {1:^{3}}".format("Індекс", "Елемент", b, c))

# виводжу елементи списку з індексами
for i, val in enumerate(sent):
    print(f"{i:>{b-11}}-й елемент:", val)

# виводжу кількість слів
print("Кількість слів -", len(sent))
