print("Школярі ділять між собою яблука.")

# задаємо значення кількості яблук
n = 0
while True:
    try:
        n = int(input("Введіть кількість яблук у кошику: "))
        if n < 0:
            print("Будь ласка, лише ціле додатне число цифрами")
        elif n >= 0:
            print("Кількість яблук -", n)
            break
    except ValueError:
        print("Будь ласка, лише ціле додатне число цифрами")

# задаємо значення кількості учнів
k = 0
while True:
    try:
        k = int(input("Введіть кількість учнів: "))
        if k <= 0:
            print("Будь ласка, лише цифрами ціле число, більше за нуль")
        elif k > 0:
            print("Кількість учнів -", k)
            break
    except ValueError:
        print("Будь ласка, лише цифрами ціле число, більше за нуль")

# отримуємо на вивід кількість яблук у учнів
if n // k - n // k // 10 * 10 == 1:
    print("Кожен учень отримає", n // k, "яблуко.")
elif 0 < n // k - n // k // 10 * 10 < 5 and n // k - n // k // 100 * 100 != 12:
    print("Кожен учень отримає", n // k, "яблуки.")
else:
    print("Кожен учень отримає", n // k, "яблук.")

# отримуємо на вивід кількість яблук, що лишилися у кошику
if n % k - n // k // 10 * 10 == 1:
    print("У кошику лишиться", n % k, "яблуко.")
elif 0 < n % k - n // k // 10 * 10 < 5 and n % k - n // k // 100 * 100 != 12:
    print("У кошику лишиться", n % k, "яблуки.")
else:
    print("У кошику лишиться", n % k, "яблук.")
