print("Школа закупає парти для учнів трьох математичних класів")

# задаємо значення кількості учнів в першому класі
cl1 = 0
while True:
    try:
        cl1 = int(input("Введіть кількість учнів в першому класі: "))
        if cl1 < 0:
            print("Будь ласка, лише цифрами ціле число")
        elif cl1 >= 0:
            print("Кількість учнів в першому класі -", cl1)
            break
    except ValueError:
        print("Будь ласка, лише цифрами ціле число")

# задаємо значення кількості учнів в другому класі
cl2 = 0
while True:
    try:
        cl2 = int(input("Введіть кількість учнів в другому класі: "))
        if cl2 < 0:
            print("Будь ласка, лише цифрами ціле число")
        elif cl2 >= 0:
            print("Кількість учнів в другому класі -", cl2)
            break
    except ValueError:
        print("Будь ласка, лише цифрами ціле число")

# задаємо значення кількості учнів в третьому класі
cl3 = 0
while True:
    try:
        cl3 = int(input("Введіть кількість учнів в третьому класі: "))
        if cl3 < 0:
            print("Будь ласка, лише цифрами ціле число")
        elif cl3 >= 0:
            print("Кількість учнів в третьому класі -", cl3)
            break
    except ValueError:
        print("Будь ласка, лише цифрами ціле число")

# обчислимо необхідну кількість парт для учнів
table = cl1 // 2 + cl2 // 2 + cl3 // 2 + cl1 % 2 + cl2 % 2 + cl3 % 2

# отримуємо на вивід кількість парт
if table - table // 10 * 10 == 1:
    print("Необхідно закупити", table, "парту.")
elif 0 < table - table // 10 * 10 < 5 and table - table // 100 * 100 != 12:
    print("Необхідно закупити", table, "парти.")
else:
    print("Необхідно закупити", table, "парт.")
