print('''Вас вітає програма "Домашня робота 4.4. Визначення високосності року."''')

# задаємо рік
year = input("Введіть рік цифрами (від 1900 до 1 000 000): ")
# перевіряємо, чи введене значення - ціле число цифрами
# якщо так - відправляємо на перевірку умовам діапазону та високосності
# якщо ні - повідомляємо про помилку та завершуємо програму
if year.isdigit():
    year = int(year)
    if 1900 <= year <= 1000000:
        if year % 400 == 0:
            print(year, "- високосний рік.")
        elif year % 4 == 0 and year % 100 != 0:
            print(year, "- високосний рік.")
        else:
            print(year, "- не високосний рік.")
    else:
        print("Помилка. Рік не відповідає умовам.")
else:
    print("Помилка. Ви ввели літери або не ціле число")
